<?php

namespace Database\Seeders;

use App\Models\Setting;
use Illuminate\Database\Seeder;

class settingSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Setting::create([
            'header_title' => 'عاشق غذاهای خوشمزه',
            'header_body' =>'با بیش از ده سال سابقه درخشان و نامی آشنا در رستوران داری، آماده خدمات رسانی به مشتریان به صورت اینترنتی هستیم. با استفاده از سامانه رزرو تهیه شده میتوانید به راحتی برای آینده برنامه ریزی کنید.',
            'about_title' => 'درباره رستوران ما بیشتر بدانید',
            'about_body' => 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.',
            'about_dinner' => 'لورم ایپسوم متن ساختگی',
            'about_lunch' => 'لورم ایپسوم متن ساختگی',
            'footer_body' => 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و ب ا استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است',
            'instagram' => '#',
            'twitter' => '#',
            'facebook' => '#',
            'address' => 'تهران، شهر ری، دولت آباد',
            'telephone' => '33339999-021',
            'contact' => 'ما منتظر سفارشات، نظرات، پیشنهادات و انتقادات شما از طریق راه های ارتباطی زیر هستیم.',
            'logo' => '#'
        ]);
    }
}
